package com.atguigu.day09;
/*
 * 一、面向对象学习的三条主线：
 * 1.java中类及类的成员：成员变量（或属性）、方法（函数）、构造器（或构造方法）;代码块（或初始化块）、内部类
 * 2.面向对象的特征：封装性、继承性、多态性、（抽象性）
 * 3.其他关键字的使用：this、super、abstract、interface、package、import、.....
 * 
 * “大处着眼，小处着手”
 * 
 * 二、面向过程 VS 面对对象
 * 举例：人把大象装进冰箱
 * 
 * 面向过程：强调的是功能行为，以函数为最小单位，考虑怎么做。
 * 
 * 1.把冰箱门打开
 * 2.把大象抬起来，塞进冰箱
 * 3.把门关上
 * 
 * 面向对象：将功能封装进对象，强调了具备功能的对象，以类/对象为最小单位，考虑谁来做。
 * 
 * 人{
 * 		
 * 		打开(冰箱){
 * 			冰箱.开开();
 * 		}
 * 
 * 		抬起(大象){
 * 			大象.进入(冰箱);
 * 		}
 * 
 * 		关闭(冰箱){
 * 			冰箱.闭合();
 * 		}
 * 
 * }
 * 
 * 
 * 大象{
 * 	
 * 		进入(冰箱){
 * 			
 * 		}
 * 
 * 
 * }
 * 
 * 
 * 冰箱{
 * 	
 * 		开开(){
 * 
 * 		}
 * 
 * 		闭合(){
 * 
 * 		}
 * 
 * }
 * 
 * 三、面向对象中最基本的要素：类、对象(或实例)
 * 
 * 类：对一类事物的描述、抽象的、概念上的定义
 * 对象：由类所派生出来的，真实存在的一个结构、实例。
 * 比如：Scanner类
 * 		Scanner scan = new Scanner(System.in);
 * 
 */
public class OOPTest {

}
